---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.CanFlipPart
source: html/38138b33-9f20-ba4e-428f-e2f16b6d4093.htm
---
# Autodesk.Revit.DB.FabricationPart.CanFlipPart Method

Validates if the fabrication part is one of the supported fabrication part types that can be flipped.

## Syntax (C#)
```csharp
public bool CanFlipPart()
```

## Returns
Returns true if valid otherwise false if the fabrication part cannot be flipped.